app/views/entries/destroy.turbo_stream.erb

<%= turbo_stream.update('main-dashboard') do %>
    <% if current_user.entries.any? %>
---
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = 1 ORDER BY "entries"."id" ASC LIMIT 1
SELECT 1 AS one FROM "entries" WHERE "entries"."user_id" = 1 LIMIT 1