app/controllers/api/v1/api_base_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def authenticate_token
    payload = JsonWebToken.decode(auth_token)
    if payload[:error]
      render json: {errors: [payload[:error]]}, status: :unauthorized
    else
      @current_user = User.find(payload["sub"])