app/controllers/entries_controller.rb

SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = 1 ORDER BY "entries"."id" ASC LIMIT 1
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = 1 AND (entries.name ILIKE '%Goo%') ORDER BY "entries"."name" ASC LIMIT 1
---
  def index
    @entries = current_user.entries.search(params[:name])
    @main_entry = @entries.first

INSERT INTO "entries" ("name", "url", "username", "password", "user_id", "created_at", "updated_at") VALUES ('Google', 'https://www.google.com/', '{"p":"uPPBYsci","h":{"iv":"XxJiKbcE9J80d7r7","at":"plm0mhyQzmTksGdq96lxxA=="}}', '{"p":"6EvYiQhz","h":{"iv":"YFepHw+WToTEYrLT","at":"tPU0caqryRe2RRz/plWO9Q=="}}', 1, '2026-02-19 14:45:13.953444', '2026-02-19 14:45:13.953444') RETURNING "id"
---
  def create
    @entry = current_user.entries.new(entry_params)
    if @entry.save

UPDATE "entries" SET "name" = 'Google?', "updated_at" = '2026-02-22 15:36:33.750981' WHERE "entries"."id" = 11
---
  def update
    if @entry.update(entry_params)

DELETE FROM "entries" WHERE "entries"."id" = 10
---
  def destroy
    @entry.destroy

SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = 1 AND "entries"."id" = 11 LIMIT 1
---
  def set_entry
    @entry = current_user.entries.find(params[:id])